{
	"Asopao": "is a rice soup very popular in Puerto Rico. When prepared with chicken, it is referred to as asopao de pollo.",
	"Ajiaco": "is a chicken soup from Colombia.",
	"Avgolemono": "is a Greek chicken soup with lemon and egg. It is also prepared as a sauce.",
	"Bánh canh ":"is a Vietnamese udon noodle soup, popular variants include bánh canh cua (crab udon soup), bánh canh chả cá (fish cake udon soup)",
	"Bird's nest soup": "is a delicacy in Chinese cuisine.",
	"Bisque": "is a thick, creamy, highly seasoned soup, classically of pureed crustaceans, of French origin.",
	"Borscht": "is a beet-vegetable soup: originally for Eastern Europe beetroots with cabbage from Ukraine and beetroots with mushrooms from Poland.",
	"Bouillabaisse": "is a fish soup from Marseille, is also made in other Mediterranean regions; in Catalonia it is called bullebesa.",
	"Bourou-bourou": "is a vegetable and pasta soup from the island of Corfu, Greece.",
	"Bún bò Huế": "is a spicy lemongrass-flavored beef noodle soup from Huế, Central Vietnam, topped with fresh herbs, sliced onions and shallots and other crunchy toppings like pork rind",
	"Caldo verde": "is a Portuguese minced kale soup",
	"Callaloo": "is a thick, creamy soup made with okra and, often, crab meat from Trinidad and Tobago",
	"Canh chua":" – (sour soup) made with rice, fish, various vegetables, and in some cases pineapple is from Vietnam.",
	"Canja de galinha": "is a Portuguese soup of chicken, rice and lemon.",
	"Cazuela": "is a Chilean soup of medium thick flavoured stock obtained from cooking several kinds of meats and vegetables mixed together.",
	"Clam chowder": "is found in two major types, New England clam chowder, made with potatoes and cream, and Manhattan clam chowder, made with a tomato base.",
	"Cock-a-leekie":" soup is leek and potato soup made with chicken stock, from Scotland.",
	"Cullen skink":", also from Scotland, is a fish soup made with smoked haddock, potatoes, onions and cream.",
	"Egg drop soup":", a savory Chinese soup, is made by adding already-beaten eggs into boiling water or broth.",
	"Egusi soup":", a traditional soup from Nigeria, is made with vegetables, meat, fish, and balls of ground melon seed. It is often eaten with fufu.",
	"Etrog": "is a fruit soup made from the citron used in Jewish rituals at the feast of Succoth, is eaten by Ashkenazi Jews at Tu Bishvat.",
	"Ezogelin":" soup is a traditional Turkish variety of lentil soup, also very common in Turkey.",
	"Faki soupa": "is a Greek lentil soup, with carrots, olive oil, herbs and possibly tomato sauce or vinegar.",
	"Fanesca": "is a traditional cod soup from Ecuador.",
	"Fasolada": "is a traditional Greek bean soup.",
	"French onion soup": "is a clear soup made with beef broth and sautéed (caramelized) onions.",
	"Garbure": "is a traditional dish in Gascony (southwest France), midway between a soup and a stew.",
	"Gazpacho":" (from Spain and Portugal) is a savory soup based on tomato.",
	"Goulash": "is a Hungarian soup of beef, paprika and onion.",
	"Gumbo": "is a traditional Creole soup from the Southern United States. It is thickened with okra pods, roux and sometimes filé powder.",
	"Halászlé":" (fisherman's soup) is a very hot and spicy Hungarian river fish soup, is made with hot paprika.",
	"Íslensk Kjötsúpa": "is a traditional Icelandic meat soup made with lamb and vegetables.",
	"Kharcho": "is a Georgian soup of lamb, rice, vegetables and a highly spiced bouillon.",
	"Kulajda": "is a Czech sour cream soup.",
	"Kuy teav":" (Vi: hủ tiếu) is a Cambodian/Southern Vietnamese pork rice noodle soup, often in combination with shrimp, squid and other seafood, topped with fresh herbs and bean sprouts.",
	"Kyselo": "is a traditional Bohemian (Krkonoše region) sour soup made from sourdough, mushrooms, cumin, potatoes and scrambled eggs.",
	"Lagman": "is a tradition in Uzbekistan, is made with pasta, vegetables, ground lamb and numerous spices.",
	"Lan Sikik": "is a Thai soup made with noodles, dried fish and tomato extract.",
	"Leek soup": "is a simple soup made from leeks, is popular in Wales during Saint David's Day.",
	"Lentil soup": "is popular in Middle Eastern and Mediterranean cuisines.",
	"London particular": "is a thick soup of pureed (dry or split) peas and ham from England; purportedly it is named after the thick fogs of th-century London.",
	"Magiritsa":" soup is made in Greece and Cyprus using lamb offal.",
	"Maryland crab soup": "is made of vegetables, blue crab meat, and Old Bay Seasoning in a tomato base, from Maryland.",
	"Menudo": "is a traditional Mexican soup, is with tripe (usually beef) and hominy.",
	"Michigan bean soup":" has been a staple for over a hundred years in the U.S. Senate dining room in the form of Senate bean soup.",
	"Minestrone": "is an Italian vegetable soup.",
	"Miso soup": "is made from fish broth and fermented soy in Japan.",
	"Mulligatawny": "is an Anglo-Indian curried soup.",
	"Nässelsoppa":" (nettle soup) is made with stinging nettles, and traditionally eaten with hard boiled egg halves, is considered a spring delicacy in Sweden.",
	"Nkatenkwan": "is a heavily spiced soup from Ghana based on groundnut with meat, most often chicken, and vegetables added. It is generally eaten with fufu.",
	"Noodle soup": "is the common name for a diverse collection of soups with varied ingredients, including noodles.",
	"Okroshka": "is a cold soup of Russian origin.",
	"Partan bree": "is a Scottish soup made with crabmeat and rice",
	"Patsás": "is made with tripe in Greece. It is also cooked in Turkey and the Balkan Peninsula.",
	"Philadelphia pepper pot":" soup is a Philadelphia specialty, is traditionally made with tripe.",
	"Phở": "is Vietnamese beef or chicken soup with scallions, welsh onion, charred ginger, wild coriander (Eryngium foetidum), basil, cinnamon, star anise, clove and black cardamom.",
	"Psarosoupa": "is a Greek fish soup, is made in various versions with a variety of fish types.",
	"Rasam": "is a South Indian traditional soup prepared using tamarind, pepper, cumin and steamed lentils.",
	"Revithia": "is a Greek chickpea soup.",
	"Sancocho": "is chicken soup with vegetables in Latin America.",
	"Scotch broth": "is made from mutton or lamb, barley and root vegetables.",
	"Shchav":" ia a sorrel soup in Polish, Russian and Yiddish cuisines, is sour from the sorrel.",
	"Shchi": "is a Russian soup with cabbage as the primary ingredient.",
	"She-crab soup": "is from Charleston, South Carolina, and is a creamy soup made with blue crab meat and crab roe.",
	"Sinigang":", from the Philippines, is a clear sour soup made from tamarind paste and meat, fish, or vegetables.",
	"Snert":" (erwtensoep) is a thick pea soup, is eaten in the Netherlands as a winter dish, and is traditionally served with sliced sausage.",
	"Solyanka":" – Russian soup on a meat, fish or vegetable broth with pickles, spices and smoked meat or fish.",
	"Sopa da Pedra": "is a rich traditional Portuguese soup with lots of ingredients.",
	"Sopa de Peixe": "is a traditional Portuguese fish soup.",
	"Soto": "is a traditional Indonesian soup made with turmeric, galangal, etc., usually contains either beef or chicken.",
	"Soupe aux Pois Jaunes": "is a traditional Canadian pea soup that is made with yellow peas and often incorporates ham.",
	"Svartsoppa": "is a traditional Swedish soup, whose main ingredient is goose and, sometimes, pig's blood, and is made in Skåne, the southernmost region of Sweden. The other ingredients typically include vinegar, port wine or cognac and spices such as cloves, ginger and allspice. The soup is served warm with boiled pieces of apple and plums, goose liver sausage and the boiled innards of the goose.",
	"Split pea soup": "is a thick soup made in the Caribbean from split peas (chickpeas or garbanzos), usually includes \"ground provision\" vegetable staples and some type of meat.",
	"Tarator": "is a Bulgarian cold soup made from yogurt and cucumbers.",
	"Thukpa bhatuk": "is a Tibetan cuisine noodle soup which centers on little hand-rolled bhatsa noodles.",
	"Tomato soup":" comes in several varieties, with tomatoes in common.",
	"Tom yum": "is the name for two similar hot and sour soups with fragrant herbs from Laos and Thailand.",
	"Tarhana soup": "is from Persian cuisine, and is made with fermented grains and yogurt.",
	"Trahanas": "is a variation of Tarhana soup, using chicken and Halloumi cheese",
	"Tuscan bean soup": "is an Italian classic, using cannellini and borlotti beans, and prosciutto",
	"Vichyssoise": "is a French-style soup invented by a French chef at the Ritz Hotel in New York City, is a cold purée of potatoes, leeks, and cream.",
	"Waterzooi": "is a Belgian fish soup.",
	"Yukgaejang": "is a Korean spicy beef soup, also includes vegetables.",
	"Żurek": "is a Polish sour rye soup with sausages, is often served in a bowl made of bread.",
	"Ärtsoppa": "is a Swedish split pea soup, served with mustard and fresh marjoram or thyme. It is traditionally eaten as lunch on Thursdays. It is served together with Swedish punsch as beverage and Swedish pancakes with preserved berries for dessert.",
	"Egg drop soup": "is a light Chinese soup.",
	"Ginseng soup": "is very popular in China and Korea; samgyetang (ginseng-stuffed chicken in broth) is considered a Korean national dish.",
	"Steamboat": "is a communal soup of meat, seafood, and vegetables dipped and cooked in hot broth on the tabletop.",
	"Miso soup": "is a light broth containing miso. It is usually served at breakfast in Japan and sometimes includes tofu, mushrooms, seaweed, or green onions.",
	"Shark fin soup": "is a Chinese soup made with shark's fin, crab meat and egg that is often served in banquets.",
	"Dried tofu skin soup": "With Shiitake mushrooms and dried oysters. Base of soup from pork ribs and/or chicken broth.",
	"Soto": "is a traditional Indonesian soup mainly composed of broth, meat and vegetables with spices. Some soto recipes uses clear broth, while some might uses coconut milk-based soup.",
	"Bakso": "is an Indonesian meatball noodle soup. The beef meatballs are served with rice vermicelli, yellow wheat noodle and vegetables in beef broth.",
	"Ramen": "is a Japanese noodle soup that comes in several varieties.",
	"Thukpa": "is Tibetan noodle soup, that is more or less the staple (along with butter tea and tsampa).",
	"Udon": "soup has thick, soft noodles in a light broth. There are many varieties with different noodles and toppings."
}